       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASIGN02.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SALES-AMOUNT PIC 999V99.
       01 SALES-TAX    PIC 99.99.
       01 MORE-DATA               PIC XXX VALUE 'YES'.

       PROCEDURE DIVISION.
       100-MAIN.
           PERFORM UNTIL MORE-DATA = 'NO '
             DISPLAY 'ENTER A SALES AMOUNT'
             ACCEPT SALES-AMOUNT
             COMPUTE SALES-TAX = 0.08 * SALES-AMOUNT
             DISPLAY 'SALES TAX ', SALES-TAX
             DISPLAY 'IS THERE MORE INPUT (YES OR NO)?'
             ACCEPT MORE-DATA
           END-PERFORM
           STOP RUN.

