       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEMPERATURES.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 FAHRENHEIT-TEMPERATURE  PIC 99.9.
       01 CENTIGRADE-TEMPERATURE  PIC 99.
       01 MORE-DATA               PIC XXX VALUE 'YES'.

       PROCEDURE DIVISION.
       100-MAIN.
           PERFORM UNTIL MORE-DATA = 'NO '
      *      DISPLAY SPACE UPON CRT
             DISPLAY 'ENTER A CENTIGRADE TEMPERATURE AS AN INTEGER'
             ACCEPT CENTIGRADE-TEMPERATURE
             COMPUTE FAHRENHEIT-TEMPERATURE = 1.8 *
                   CENTIGRADE-TEMPERATURE + 32
             DISPLAY 'FARENHEIT TEMPERATURE ', FAHRENHEIT-TEMPERATURE
             DISPLAY '1  IS THERE MORE INPUT (YES OR NO)?'
             ACCEPT MORE-DATA
           END-PERFORM
           STOP RUN.


