       IDENTIFICATION DIVISION.
       PROGRAM-ID. ASIGN03.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SALES-AMOUNT PIC 999V99.
       01 COMMISSION   PIC 999.99.
       01 MORE-DATA               PIC XXX VALUE 'YES'.

       PROCEDURE DIVISION.
       100-MAIN.
           PERFORM UNTIL MORE-DATA = 'NO '
             DISPLAY 'ENTER A SALES AMOUNT'
             ACCEPT SALES-AMOUNT
             COMPUTE COMMISSION = 0.12 * SALES-AMOUNT
             DISPLAY 'COMMISSION IS ', COMMISSION
             DISPLAY 'IS THERE MORE INPUT (YES OR NO)?'
             ACCEPT MORE-DATA
           END-PERFORM
           STOP RUN.

