       >>SOURCE FORMAT FIXED
       IDENTIFICATION DIVISION.
       PROGRAM-ID. CH01A03.
       
       ENVIRONMENT DIVISION.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  SALES-AMOUNT    PIC 999V99.
       01  SALES-COMMISION PIC 999V99.
       01  MORE-DATA       PIC XXX VALUE "YES".
       
       
       PROCEDURE DIVISION.
       100-MAIN.
           PERFORM UNTIL MORE-DATA = "NO"
             DISPLAY 'ENTER SALES AMOUNT : '
             ACCEPT SALES-AMOUNT
             COMPUTE SALES-COMMISION = SALES-AMOUNT * .12
             DISPLAY 'SALES COMMISION AMOUNT : '
             DISPLAY SALES-COMMISION
             DISPLAY "IS THERE MORE INPUT (YES OR NO)?"
             ACCEPT MORE-DATA
           END-PERFORM
           STOP RUN
           .
