    IDENTIFICATION DIVISION.
    PROGRAM-ID. SAMPLE2.
    ENVIRONMENT DIVISION.
    INPUT-OUTPUT SECTION.
    FILE-CONTROL.
        SELECT MASTER-PAYROLL 
            ASSIGN TO 'MASTER.DAT'
            ORGANIZATION IS LINE SEQUENTIAL.
        SELECT WEEK-PAYROLL
            ASSIGN TO 'PAYROLL.DAT'
            ORGANIZATION IS LINE SEQUENTIAL
        SELECT PRINT-FILE
            ASSIGN TO PRINTER-1
            ORGANIZATION IS LINE SEQUENTIAL
    
    DATA DIVISION.
    FILE SECTION.
    WORKING-STORAGE SECTION.
    
    PROCEDURE DIVISION.
    100-MAIN.
        STOP RUN
        .
